def main():
    bugs = {
        "caterpillar" : {"length" : 3.0, "width": 1.0},
        "ladybug" : {"length" : 1.0, "width" : 3.0}
    }

    '''Linear Function'''
    '''------------------------------------'''
    '''|                y=Ax               '''
    '''------------------------------------'''

    A = 0.25

    x = bugs['ladybug']['width']


    #желаемый результат при x = 3
    t = 1.1

    #полученный результат
    y = A*x
    print(y)

    #погрешность/ошабка/расхождение
    E = t - y
    print(E)


    # delta_A <-- вот на столько нужно изменить "A" чтобы при умножении "A*x" "y" равнялось 1.1
    delta_A = E/x

	''' E делим на текущюю x'''

    print(delta_A)

    A = A + delta_A

    print(A)

    '''---------------------------------------------------------------------------------'''
    '''| Мы ищем, насколько надо изменить ​A​ для улучшения наклона разделяющей прямой в |'''
    '''| зависимости от текущей погрешности ​E​. Мы уже нашли зависимость между ​E​ и ​A​:   |'''
    '''---------------------------------------------------------------------------------'''

if __name__ == "__main__":
    main()